holiday/app/controllers/holidays_controller.rb

  def index
login_required

@holiday = Holiday.all
---
SELECT * FROM "holidays"

  def show
login_required

@holiday = Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)

  def edit
  @holiday= Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 7)

  def update
  @holiday = Holiday.find(params[:id])
if@holiday.save
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 7)
UPDATE "holidays" SET "approved" = '', "updated_at" = '2012-01-26 13:22:24', "comments" = '', "name" = 'Jamie FinalyD' WHERE "id" = 7

  def create
    @holiday = Holiday.create(params[:holiday])
    @holiday.user_id = current_user.id
if@holiday.save
---
INSERT INTO "holidays" ("name", "created_at", "comments", "updated_at", "datesubmitted", "approved", "datereturning", "dateapprej", "user_id", "dateleaving") VALUES('Jimmy', '2012-01-19 18:22:42', NULL, '2012-01-19 18:22:42', NULL, NULL, '2012-09-01', NULL, NULL, '2011-10-10')
UPDATE "holidays" SET "updated_at" = '2012-01-23 08:59:50', "user_id" = 3 WHERE "id" = 16

def destroy
  @holiday = Holiday.find(params[:id])
  @holiday.destroy
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)
DELETE FROM "holidays" WHERE ("id" IN (1))