holiday/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "admin", "password_salt", "password_hash", "email") VALUES('2012-01-26 16:31:55', '2012-01-26 16:31:55', 'Test', NULL, 'eb65c2253872cdd10d8718b9b0f9e083ae4b4be6', '8a90a1448996eae5ff78eb976ab450187ac268d6', 'test@example.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save